_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 179, 169, 208, 5)  140       
_________________________________________________________________
batch_normalization_1 (Batch (None, 179, 169, 208, 5)  20        
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 89, 84, 104, 5)    0         
_________________________________________________________________
activation_1 (Activation)    (None, 89, 84, 104, 5)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 89, 84, 104, 5)    680       
_________________________________________________________________
batch_normalization_2 (Batch (None, 89, 84, 104, 5)    20        
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 44, 42, 52, 5)     0         
_________________________________________________________________
activation_2 (Activation)    (None, 44, 42, 52, 5)     0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 44, 42, 52, 5)     680       
_________________________________________________________________
batch_normalization_3 (Batch (None, 44, 42, 52, 5)     20        
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 22, 21, 26, 5)     0         
_________________________________________________________________
activation_3 (Activation)    (None, 22, 21, 26, 5)     0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 22, 21, 26, 5)     0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 60060)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 120122    
=================================================================
Total params: 121,682
Trainable params: 121,652
Non-trainable params: 30