______________________________________________________________________________________________________________________________________________________
Layer (type)                                     Output Shape                     Param #           Connected to                                      
======================================================================================================================================================
input_1 (InputLayer)                             (None, 179, 169, 208, 1)         0                                                                   
______________________________________________________________________________________________________________________________________________________
conv3d_1 (Conv3D)                                (None, 90, 85, 104, 10)          3440              input_1[0][0]                                     
______________________________________________________________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)                   (None, 45, 43, 52, 10)           0                 conv3d_1[0][0]                                    
______________________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)       (None, 45, 43, 52, 10)           40                max_pooling3d_1[0][0]                             
______________________________________________________________________________________________________________________________________________________
re_lu_1 (ReLU)                                   (None, 45, 43, 52, 10)           0                 batch_normalization_1[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_2 (Conv3D)                                (None, 45, 43, 52, 8)            88                re_lu_1[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)       (None, 45, 43, 52, 8)            32                conv3d_2[0][0]                                    
______________________________________________________________________________________________________________________________________________________
re_lu_2 (ReLU)                                   (None, 45, 43, 52, 8)            0                 batch_normalization_2[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_3 (Conv3D)                                (None, 45, 43, 52, 8)            1736              re_lu_2[0][0]                                     
______________________________________________________________________________________________________________________________________________________
concatenate_1 (Concatenate)                      (None, 45, 43, 52, 18)           0                 conv3d_3[0][0]                                    
                                                                                                    max_pooling3d_1[0][0]                             
______________________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)       (None, 45, 43, 52, 18)           72                concatenate_1[0][0]                               
______________________________________________________________________________________________________________________________________________________
re_lu_3 (ReLU)                                   (None, 45, 43, 52, 18)           0                 batch_normalization_3[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_4 (Conv3D)                                (None, 45, 43, 52, 8)            152               re_lu_3[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)       (None, 45, 43, 52, 8)            32                conv3d_4[0][0]                                    
______________________________________________________________________________________________________________________________________________________
re_lu_4 (ReLU)                                   (None, 45, 43, 52, 8)            0                 batch_normalization_4[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_5 (Conv3D)                                (None, 45, 43, 52, 8)            1736              re_lu_4[0][0]                                     
______________________________________________________________________________________________________________________________________________________
concatenate_2 (Concatenate)                      (None, 45, 43, 52, 26)           0                 conv3d_5[0][0]                                    
                                                                                                    concatenate_1[0][0]                               
______________________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)       (None, 45, 43, 52, 26)           104               concatenate_2[0][0]                               
______________________________________________________________________________________________________________________________________________________
re_lu_5 (ReLU)                                   (None, 45, 43, 52, 26)           0                 batch_normalization_5[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_6 (Conv3D)                                (None, 45, 43, 52, 8)            216               re_lu_5[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)       (None, 45, 43, 52, 8)            32                conv3d_6[0][0]                                    
______________________________________________________________________________________________________________________________________________________
re_lu_6 (ReLU)                                   (None, 45, 43, 52, 8)            0                 batch_normalization_6[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_7 (Conv3D)                                (None, 45, 43, 52, 8)            1736              re_lu_6[0][0]                                     
______________________________________________________________________________________________________________________________________________________
concatenate_3 (Concatenate)                      (None, 45, 43, 52, 34)           0                 conv3d_7[0][0]                                    
                                                                                                    concatenate_2[0][0]                               
______________________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)       (None, 45, 43, 52, 34)           136               concatenate_3[0][0]                               
______________________________________________________________________________________________________________________________________________________
re_lu_7 (ReLU)                                   (None, 45, 43, 52, 34)           0                 batch_normalization_7[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_8 (Conv3D)                                (None, 45, 43, 52, 17)           595               re_lu_7[0][0]                                     
______________________________________________________________________________________________________________________________________________________
average_pooling3d_1 (AveragePooling3D)           (None, 23, 22, 26, 17)           0                 conv3d_8[0][0]                                    
______________________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)       (None, 23, 22, 26, 17)           68                average_pooling3d_1[0][0]                         
______________________________________________________________________________________________________________________________________________________
re_lu_8 (ReLU)                                   (None, 23, 22, 26, 17)           0                 batch_normalization_8[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_9 (Conv3D)                                (None, 23, 22, 26, 8)            144               re_lu_8[0][0]                                     
______________________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)       (None, 23, 22, 26, 8)            32                conv3d_9[0][0]                                    
______________________________________________________________________________________________________________________________________________________
re_lu_9 (ReLU)                                   (None, 23, 22, 26, 8)            0                 batch_normalization_9[0][0]                       
______________________________________________________________________________________________________________________________________________________
conv3d_10 (Conv3D)                               (None, 23, 22, 26, 8)            1736              re_lu_9[0][0]                                     
______________________________________________________________________________________________________________________________________________________
concatenate_4 (Concatenate)                      (None, 23, 22, 26, 25)           0                 conv3d_10[0][0]                                   
                                                                                                    average_pooling3d_1[0][0]                         
______________________________________________________________________________________________________________________________________________________
batch_normalization_10 (BatchNormalization)      (None, 23, 22, 26, 25)           100               concatenate_4[0][0]                               
______________________________________________________________________________________________________________________________________________________
re_lu_10 (ReLU)                                  (None, 23, 22, 26, 25)           0                 batch_normalization_10[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv3d_11 (Conv3D)                               (None, 23, 22, 26, 8)            208               re_lu_10[0][0]                                    
______________________________________________________________________________________________________________________________________________________
batch_normalization_11 (BatchNormalization)      (None, 23, 22, 26, 8)            32                conv3d_11[0][0]                                   
______________________________________________________________________________________________________________________________________________________
re_lu_11 (ReLU)                                  (None, 23, 22, 26, 8)            0                 batch_normalization_11[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv3d_12 (Conv3D)                               (None, 23, 22, 26, 8)            1736              re_lu_11[0][0]                                    
______________________________________________________________________________________________________________________________________________________
concatenate_5 (Concatenate)                      (None, 23, 22, 26, 33)           0                 conv3d_12[0][0]                                   
                                                                                                    concatenate_4[0][0]                               
______________________________________________________________________________________________________________________________________________________
batch_normalization_12 (BatchNormalization)      (None, 23, 22, 26, 33)           132               concatenate_5[0][0]                               
______________________________________________________________________________________________________________________________________________________
re_lu_12 (ReLU)                                  (None, 23, 22, 26, 33)           0                 batch_normalization_12[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv3d_13 (Conv3D)                               (None, 23, 22, 26, 8)            272               re_lu_12[0][0]                                    
______________________________________________________________________________________________________________________________________________________
batch_normalization_13 (BatchNormalization)      (None, 23, 22, 26, 8)            32                conv3d_13[0][0]                                   
______________________________________________________________________________________________________________________________________________________
re_lu_13 (ReLU)                                  (None, 23, 22, 26, 8)            0                 batch_normalization_13[0][0]                      
______________________________________________________________________________________________________________________________________________________
conv3d_14 (Conv3D)                               (None, 23, 22, 26, 8)            1736              re_lu_13[0][0]                                    
______________________________________________________________________________________________________________________________________________________
concatenate_6 (Concatenate)                      (None, 23, 22, 26, 41)           0                 conv3d_14[0][0]                                   
                                                                                                    concatenate_5[0][0]                               
______________________________________________________________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)                   (None, 11, 11, 13, 41)           0                 concatenate_6[0][0]                               
______________________________________________________________________________________________________________________________________________________
activation_1 (Activation)                        (None, 11, 11, 13, 41)           0                 max_pooling3d_2[0][0]                             
______________________________________________________________________________________________________________________________________________________
dropout_1 (Dropout)                              (None, 11, 11, 13, 41)           0                 activation_1[0][0]                                
______________________________________________________________________________________________________________________________________________________
flatten_1 (Flatten)                              (None, 64493)                    0                 dropout_1[0][0]                                   
______________________________________________________________________________________________________________________________________________________
dense_1 (Dense)                                  (None, 2)                        128988            flatten_1[0][0]                                   
======================================================================================================================================================
Total params: 145,363
Trainable params: 144,941
Non-trainable params: 422
______________________________________________________________________________________________________________________________________________________
