__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 179, 169, 208 0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 179, 169, 208 140         input_1[0][0]                    
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 179, 169, 208 680         conv3d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 179, 169, 208 20          conv3d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 89, 84, 104,  0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 89, 84, 104,  0           max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 89, 84, 104,  680         activation_1[0][0]               
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 89, 84, 104,  680         conv3d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 89, 84, 104,  20          conv3d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_2 (MaxPooling3D)  (None, 89, 84, 104,  0           input_1[0][0]                    
__________________________________________________________________________________________________
add_1 (Add)                     (None, 89, 84, 104,  0           batch_normalization_2[0][0]      
                                                                 max_pooling3d_2[0][0]            
__________________________________________________________________________________________________
max_pooling3d_3 (MaxPooling3D)  (None, 44, 42, 52, 5 0           add_1[0][0]                      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 44, 42, 52, 5 0           max_pooling3d_3[0][0]            
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 44, 42, 52, 5 680         activation_2[0][0]               
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 44, 42, 52, 5 680         conv3d_5[0][0]                   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 44, 42, 52, 5 680         conv3d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 44, 42, 52, 5 20          conv3d_7[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_4 (MaxPooling3D)  (None, 22, 21, 26, 5 0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 22, 21, 26, 5 0           max_pooling3d_4[0][0]            
__________________________________________________________________________________________________
conv3d_8 (Conv3D)               (None, 22, 21, 26, 5 680         activation_3[0][0]               
__________________________________________________________________________________________________
conv3d_9 (Conv3D)               (None, 22, 21, 26, 5 680         conv3d_8[0][0]                   
__________________________________________________________________________________________________
conv3d_10 (Conv3D)              (None, 22, 21, 26, 5 680         conv3d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 22, 21, 26, 5 20          conv3d_10[0][0]                  
__________________________________________________________________________________________________
max_pooling3d_5 (MaxPooling3D)  (None, 22, 21, 26, 5 0           activation_2[0][0]               
__________________________________________________________________________________________________
add_2 (Add)                     (None, 22, 21, 26, 5 0           batch_normalization_4[0][0]      
                                                                 max_pooling3d_5[0][0]            
__________________________________________________________________________________________________
max_pooling3d_6 (MaxPooling3D)  (None, 11, 10, 13, 5 0           add_2[0][0]                      
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 11, 10, 13, 5 0           max_pooling3d_6[0][0]            
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 11, 10, 13, 5 0           activation_4[0][0]               
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 7150)         0           dropout_1[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            14302       flatten_1[0][0]                  
==================================================================================================
Total params: 20,642
Trainable params: 20,602
Non-trainable params: 40
___________________________