_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv3d_1 (Conv3D)            (None, 179, 169, 208, 8)  224       
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 179, 169, 208, 8)  1736      
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (None, 89, 84, 104, 8)    0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 89, 84, 104, 8)    32        
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 89, 84, 104, 8)    1736      
_________________________________________________________________
conv3d_4 (Conv3D)            (None, 89, 84, 104, 8)    1736      
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (None, 44, 42, 52, 8)     0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 44, 42, 52, 8)     32        
_________________________________________________________________
conv3d_5 (Conv3D)            (None, 44, 42, 52, 8)     1736      
_________________________________________________________________
conv3d_6 (Conv3D)            (None, 44, 42, 52, 8)     1736      
_________________________________________________________________
conv3d_7 (Conv3D)            (None, 44, 42, 52, 8)     1736      
_________________________________________________________________
max_pooling3d_3 (MaxPooling3 (None, 22, 21, 26, 8)     0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 22, 21, 26, 8)     32        
_________________________________________________________________
conv3d_8 (Conv3D)            (None, 22, 21, 26, 8)     1736      
_________________________________________________________________
conv3d_9 (Conv3D)            (None, 22, 21, 26, 8)     1736      
_________________________________________________________________
conv3d_10 (Conv3D)           (None, 22, 21, 26, 8)     1736      
_________________________________________________________________
max_pooling3d_4 (MaxPooling3 (None, 11, 10, 13, 8)     0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 11, 10, 13, 8)     32        
_________________________________________________________________
spatial_dropout3d_1 (Spatial (None, 11, 10, 13, 8)     0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 11440)             0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 11440)             0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                732224    
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 32)                2080      
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 2)                 66        
=================================================================
Total params: 750,346
Trainable params: 750,282
Non-trainable params: 64